'''Создайте класс Lion. В нем должен быть метод roar, который печатает на экран "Rrrrrrr!!!"'''

class Lion:
    def roar(self):
        print('Rrrrrrr!!!')

simba = Lion()
simba.roar()
